v2206/atmospheric_Microclimate/benchmark_atmSims/atmDownstreamDevelopment/setups.orig/common/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

kappa                0.40;          // (HW:p. 358)
Cmu                  0.09;          // (HW:p. 358)
flowDir              (1 0 0);       // (HW:Fig. 1)
zDir                 (0 0 1);       // (HW:Fig. 1)
Uref                 10.0;          // (HW:Table 1)
Zref                 6.0;           // (HW:Table 1)
z0                   uniform 0.01;  // (HW:Table 1)
d                    uniform 0.0;


// ************************************************************************* //
